Revit 2027 API
BuiltInFailures.PropertySetElementFailures.EmptyPropertySetName Property
 A property set name cannot be an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EmptyPropertySetName { get; }
Public Shared ReadOnly Property EmptyPropertySetName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EmptyPropertySetName {
	FailureDefinitionId^ get ();
}
static member EmptyPropertySetName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PropertySetElementFailures Class
Autodesk.Revit.DB Namespace